In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/titanic_test.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## loc

In [3]:
df.loc[0,'PassengerId']

892

In [4]:
df.set_index("Name", inplace=True)
df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,male,34.5,0,0,330911,7.8292,NaN,Q
"Wilkes, Mrs. James (Ellen Needs)",893,3,female,47.0,1,0,363272,7.0000,NaN,S
"Myles, Mr. Thomas Francis",894,2,male,62.0,0,0,240276,9.6875,NaN,Q
"Wirz, Mr. Albert",895,3,male,27.0,0,0,315154,8.6625,NaN,S
"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df.loc['Kelly, Mr. James', 'PassengerId']

892

## iloc

In [6]:
df.iloc[0, 0]

892

In [7]:
df.iloc[1,0]

893

## Multiple Cols and Rows

In [8]:
df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,male,34.5,0,0,330911,7.8292,NaN,Q
"Wilkes, Mrs. James (Ellen Needs)",893,3,female,47.0,1,0,363272,7.0000,NaN,S
"Myles, Mr. Thomas Francis",894,2,male,62.0,0,0,240276,9.6875,NaN,Q
"Wirz, Mr. Albert",895,3,male,27.0,0,0,315154,8.6625,NaN,S
"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
df.iloc[0:3,0:2]

                                  PassengerId  Pclass
Name
Kelly, Mr. James                          892       3
Wilkes, Mrs. James (Ellen Needs)          893       3
Myles, Mr. Thomas Francis                 894       2

In [10]:
df.loc['Kelly, Mr. James':'Myles, Mr. Thomas Francis', 'PassengerId':'Pclass']

                                  PassengerId  Pclass
Name
Kelly, Mr. James                          892       3
Wilkes, Mrs. James (Ellen Needs)          893       3
Myles, Mr. Thomas Francis                 894       2

In [11]:
df[['PassengerId','Pclass']].head()

                                              PassengerId  Pclass
Name
Kelly, Mr. James                                      892       3
Wilkes, Mrs. James (Ellen Needs)                      893       3
Myles, Mr. Thomas Francis                             894       2
Wirz, Mr. Albert                                      895       3
Hirvonen, Mrs. Alexander (Helga E Lindqvist)          896       3

## Retrieve Value on First Line of Filter

In [12]:
df[(df.Pclass==2) & (df.Ticket=='SC/PARIS 2167')].reset_index()

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",907,2,female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C

In [13]:
df[(df.Pclass==2) & (df.Ticket=='SC/PARIS 2167')].reset_index().loc[0,"Age"]

24.0